Repository: 84000/data-translation-memory
Catalog: toh503_84000-the-detailed-account-of-the-previous-aspirations-of-the-seven-thus-gone-ones.tmx
Source language: bo
Languages: en

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གསུམ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་གོས་དང་། རྒྱན་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་བྲལ་ཞིང་མི་ལྡན་པའི་དབང་གིས་སྡུག་བསྔལ་མྱོང་ཞིང་སྡིག་པ་བྱེད་པ་དེ་དག་བདག་གི་མཐུས་གོས་དང་། རྒྱན་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོངས་སུ་སྤྱད་པ་དང་། ལོངས་སྤྱོད་རྣམས་བསམས་མ་ཐག་ཏུ་འབྱུང་ཞིང་མི་ལྡན་པ་མེད་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་སུ་ཡང་ཅི་དང་ཡང་མི་ལྡན་པ་མེད་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: “For his third great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who lack clothing, jewelry, perfumes, garlands, ointments, bedding, and medicine, who suffer because of what they lack, and who perform misdeeds to have clothing, jewelry, perfumes, garlands, ointments, bedding, medicines, material possessions, and wealth as soon as they think about them, and may they lack nothing. May none of them lack anything in any way whatsoever for as long as it takes them to attain liberation.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་བཞི་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་ཕན་ཚུན་འཐབ་མོ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པར་གྱུར་ཅིང་གཅིག་ལ་གཅིག་གནོད་པ་བྱ་བ་དང་། གསད་པར་བྱ་བའི་ཕྱིར་བརྟུལ་བ།
en: “For his fourth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who quarrel, fight, argue, and dispute with one another due to the ripening of their karma from a previous life, who are trained to harm and kill one another, and who strike one another with blades, arrows, and clubs hear my name and keep it in mind.

source: མཚོན་དང་། མདའ་དང་། དབྱུག་པ་དག་གིས་བསྣུན་པ་དེ་ན་གང་དག་གིས་དེའི་ཚེ་བདག་གི་མིང་ཐོས་ཤིང་ཡིད་ལ་གནས་པ་དེ་དག་བདག་གི་མཐུས་བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་ན་མདའ་དང་། མཚོན་དང་། དབྱུག་པ་ལ་སོགས་པ་སླར་ལྡོག་པར་གྱུར་ཅིག །ཕྱིར་ཕྱོགས་པར་གྱུར་ཅིག །དགྲ་ཐམས་ཅད་ཀྱང་བྱམས་པ་ལ་གནས་པར་གྱུར་ཅིག །སུའི་སྲོག་གི་དབང་པོ་ཡང་འགག་པར་མ་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་རང་རང་གི་རྫས་དང་། ལོངས་སྤྱོད་དང་། དབང་ཕྱུག་དག་གིས་ཆོག་ཤེས་པར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ།
en: By my power, when they mentally recite my name, may the arrows, blades, clubs and the like be repelled and turned back. May all their enemies become friends, and may no one lose their life. May they be content with their own material possessions, wealth, and power for as long as it takes them to attain awakening.’ Mañjuśrī, such were the four great aspirations that the blessed, thus-gone, worthy, and perfect Buddha Dharmakīrtisāgaraghoṣa made long ago, when he was practicing bodhisattva conduct.

source: འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བཞི་པོ་དེ་དག་བཏབ་བོ། །འཇམ་དཔལ་གང་ལ་ལ་ཞིག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་དེའི་མཚན་ཐོས་པ་དང་། འཛིན་པ་དང་། དད་པར་བྱེད་པ་དང་། རབ་ཏུ་གུས་པར་མཆོད་པ་བྱེད་པ་དེ་སྡིག་པ་ཐམས་ཅད་ཡོངས་སུ་བྱང་ནས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར།
en: “Mañjuśrī, all who hear the name of the blessed, thus-gone, worthy, and perfect Buddha Dharmakīrtisāgaraghoṣa, bear it in mind, cultivate faith in it, and make offerings with utter devotion will purify all their misdeeds.

source: ཚེ་རབས་ཐམས་ཅད་དུ་ཚེ་རབས་དྲན་པར་འགྱུར། ནམ་དུ་ཡང་བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་དང་མི་འབྲལ་བར་འགྱུར།
en: They will not regress on the path to the awakening of a buddha, in all their future lifetimes they will remember their past lives, and their thoughts will never stray from the mind of awakening.

source: སྐྱེ་བ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་དང་པ་དང་ཕྲད་པར་འགྱུར། རྟག་ཏུ་ནད་མེད་ཅིང་ཚེ་རིང་བར་འགྱུར།
en: They will meet with the thus-gone ones in all their rebirths, and they will always be healthy and live long lives.

source: འདི་ནས་ཤི་འཕོས་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་དེར་སྐྱེས་པར་འགྱུར། གཞན་ཡང་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར།
en: When they pass away, they will be born in that world, and they will never again fall to the lower realms.

source: གང་དང་གང་དུ་སྐྱེ་བར་བསམས་མ་ཐག་ཏུ་གོས་དང་། རྒྱན་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་དང་། ལོངས་སྤྱོད་དང་། དབང་ཕྱུག་དང་ལྡན་པར་འགྱུར་རོ།
en: Wherever they are born, they will possess clothing, jewelry, perfumes, garlands, ointments, bedding, medicines, necessities, material possessions, and power as soon as they think of them.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་དེའི་མཚན་འཛིན་པ་དང་། ཉན་པ་དེ་ནི་དེ་ལྟར་ཡོན་ཏན་མང་པོ་དག་དང་ལྡན་ནོ།
en: Mañjuśrī, such are the many good qualities associated with bearing in mind and hearing the name of the thus-gone, worthy, and perfect Buddha Dharmakīrtisāgaraghoṣa.

source: །འཇམ་དཔལ་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དགུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་རྒྱ་མཚོར་ལེགས་པར་གནས་པ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་རྒྱ་མཚོ་མཆོག་གི་བློས་རྣམ་པར་རོལ་པ་མངོན་པར་མཁྱེན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Mañjuśrī, to the east of this buddhafield, past as many buddhafields as there are grains of sand in nine Gaṅgā rivers, the blessed, thus-gone, worthy, and perfect Buddha Dharma­sāgarā­gramati­vikrīḍitā­bhijñā­rāja lives in the world Standing in an Ocean of Jewels.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བཞི་བཏབ་བོ། །བཞི་གང་ཞེ་ན།
en: “Mañjuśrī, long ago, when he was practicing bodhisattva conduct, that blessed one proclaimed the following four great aspirations:

source: དེའི་སྨོན་ལམ་ཆེན་པོ་དང་པོ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་སུ་དག་ཞིང་ལས་དང་། ས་བོན་འདེབས་པ་དང་། ཚོང་བྱེད་པ་དང་། འཐབ་མོ་དང་། རྩོད་པ་ལ་སྤྲོ་བ་དང་། སྡིག་པའི་ལས་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས།
en: “For his first great aspiration, he proclaimed, ‘In the future, when I attain awakening as a perfect buddha who has realized unsurpassed and perfect awakening, wherever there are beings who work the fields, sow seeds, trade in goods, fight battles, delight in arguing, and perform misdeeds, may they hear my name.

source: བདག་གི་མིང་ཐོས་ནས་བདག་གི་མཐུས་བསམས་མ་ཐག་ཏུ་འཚོག་ཆས་ཐམས་ཅད་འབྱོར་བར་གྱུར་ཅིག །གནོད་སེམས་མང་བར་མ་གྱུར་ཅིག །རྟག་ཏུ་དགེ་བའི་ཆོས་སྤྱོད་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: By my power, may they gain an abundance of all manner of goods as soon as they think of them. May they have no ill intent and may their behavior always be virtuous.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གཉིས་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ་བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་སུ་དག་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཏེ། ཡང་དག་པར་བླངས་པས་སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་བ་དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས།
en: “For his second great aspiration, he proclaimed, ‘In the future, when I attain awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who have taken the path of the ten nonvirtues and will thus proceed to the hell realms hear my name.

source: བདག་གི་མཐུས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་གྱུར་ཅིག །སེམས་ཅན་གང་ཡང་སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་མ་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: By my power, may they take the path of the ten virtues, and may they not proceed to the hell realms.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གསུམ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་གཞན་གྱི་དབང་དུ་སོང་སྟེ། ཆད་པས་བཅད་པ་དང་། བརྡེག་པ་དང་། གོ་རར་གཞུག་པ་དང་། གསད་པར་འོས་པ་དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས། བདག་གི་འོད་ཀྱིས་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་བཅིང་བ་དང་། བརྡེག་པ་དེ་དག་རྒྱུན་ཆད་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: “For his third great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who have come under another person’s control, who are arrested, beaten, imprisoned, and sentenced to death, hear my name, and may my light prevent them from being bound and beaten for as long as it takes them to attain awakening.’

source: །དེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། སྨོན་ལམ་ཆེན་པོ་བཞི་པ་བཏབ་པ་ནི། གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ་བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་སུ་དག་ཚེ་ཐུང་བར་འགྱུར་བའི་སྡིག་པ་མི་དགེ་བ་རྣམ་པ་སྣ་ཚོགས་བྱས་ཏེ་འཆི་བར་འགྱུར་བ་དེ་དག་འཆི་བའི་དུས་ཀྱི་ཚེ།
en: “For the fourth great aspiration when he was practicing bodhisattva conduct, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who have committed various types of unvirtuous misdeeds that shorten one’s lifespan hear my name at the moment of death.

source: བདག་གི་མིང་རྣ་ལམ་དུ་གྲག་པར་གྱུར་ཅིག །དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ལྷ་དང་མིའི་བདེ་བ་མྱོང་བར་གྱུར་ཅིག །སྡིག་པའི་ལས་ཐམས་ཅད་ཡོངས་སུ་བྱང་བར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ། འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་རྒྱ་མཚོ་མཆོག་གི་བློས་རྣམ་པར་རོལ་པ་མངོན་པར་མཁྱེན་པ་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། སྨོན་ལམ་ཆེན་པོ་བཞི་པོ་དེ་དག་བཏབ་བོ།
en: After hearing my name, may they take rebirth in the joyful, heavenly realms. May they experience the happiness of divine and human births for as long as it takes them to attain awakening, and may all the karma of their misdeeds be purified.’ Mañjuśrī, those are the four great aspirations that the blessed, thus-gone, worthy, and perfect Buddha Dharma­sāgarā­gramati­vikrīḍitā­bhijñā­rāja proclaimed long ago, when he was practicing bodhisattva conduct.

source: འཇམ་དཔལ་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་རྒྱ་མཚོར་ལེགས་པར་གནས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ནི། འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་དང་ལྡན་པ་ན་ཅི་འདྲ་བ་ཡོད་པ་དེ་འདྲའོ།
en: “Mañjuśrī, the array of good qualities of his buddhafield—the world Standing in an Ocean of Jewels—is just like that in the world Abounding in Jewels.

source: །འཇམ་དཔལ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདུན་པོ་དེ་དག་གི་མཚན་ཐོས་ལ་ཐོས་ནས་ཀྱང་འཛིན་པ་དང་། ནང་པར་ལངས་ནས་ཡིད་ལ་བྱེད་པ་དང་། དད་པར་བྱེད་པ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། རོལ་མོའི་སྒྲ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དག་གིས་མཆོད་པ་དང་། གླེགས་བམ་ལ་བྲིས་ཏེ་འཆང་བ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་འཇུག་པ་དང་། སེམས་བཏུད་དེ་གཞན་ལས་ཉན་པ་དང་། ཆོས་སྨྲ་བ་དེ་དག་ལ་ཡང་འཚོག་ཆས་དང་། ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་མཆོད་པར་བྱེད་པ་དེ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱི་བར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།། །།འཕགས་པ་དེ་བཞིན་གཤེགས་པ་བདུན་གྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ། བམ་པོ་གཉིས་པ་སྟེ་ཐ་མ།
en: Mañjuśrī, any son or daughter of good family who hears the names of the seven perfect buddhas, and after hearing them bears them in mind, reflects upon them after waking in the morning, cultivates faith in them, makes offerings to them with flowers, incense, perfumes, garlands, ointments, music, instruments, and drums, writes them in a book and carries it, copies this Dharma discourse, commissions it to be written, reveres it, hears it from someone else, and performs offerings to those Dharma teachers using all manner of implements and articles, shall be blessed by all the buddhas and pursue the path of becoming a perfect buddha for as long as it takes to attain the awakening of a buddha.”

source: འཇམ་དཔལ་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་བཻ་ཌཱུརྱ་ར་སྣང་བ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: “Mañjuśrī, to the east of this buddhafield, past as many buddhafields as there are grains of sand in ten Gaṅgā rivers, lives the blessed Buddha Bhaiṣajya­guru­vaiḍūrya­prabha in the world Vaiḍūryanirbhāsa.

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་སོ།
en: He is a thus-gone, worthy, and perfect buddha, someone endowed with knowledge and good conduct, a well-gone one, a knower of the world, a charioteer who tames people, an unsurpassed being, and a teacher of gods and humans.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། སྨོན་ལམ་ཆེན་པོ་བཅུ་གཉིས་པོ་འདི་དག་བཏབ་བོ། །བཅུ་གཉིས་གང་ཞེ་ན།
en: “Mañjuśrī, long ago, when he was practicing bodhisattva conduct, the blessed Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabha proclaimed the following twelve great aspirations:

source: དེའི་སྨོན་ལམ་ཆེན་པོ་དང་པོ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། བདག་གི་ལུས་ཀྱི་འོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་དཔག་ཏུ་མེད་ཅིང་དཔག་གིས་མི་ལང་བ་དག་ལམ་མེ་ལྷན་ནེ་ལྷང་ངེར་གྱུར་ཅིག །སེམས་ཅན་ཐམས་ཅད་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ལེགས་པར་བརྒྱན་པར་གྱུར་ཏེ།
en: “For his first great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may my body’s radiance illuminate innumerable, limitless, and immeasurable worlds, warm them, and make them shine.

source: བདག་ཅི་འདྲ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་དེ་འདྲ་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་གཉིས་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན།
en: May all beings be adorned with the thirty-two marks of a great person and the eighty minor marks, just as I am.’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ་བདག་བྱང་ཆུབ་ཐོབ་པ་ན།
en: “For his second great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may my body be like a precious blue beryl gem—pure inside and out, and radiating a stainless light.

source: ལུས་ནོར་བུ་རིན་པོ་ཆེ་བཻ་ཌཱུརྱ་ཅི་འདྲ་བ་དེ་འདྲ་བར་ཕྱི་ནང་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་དང་། དྲི་མ་མེད་པ་འོད་གསལ་བ་དང་། ཁོ་ལག་ཡངས་ཤིང་ཆེ་བ་དང་། དཔལ་དང་གཟི་བརྗིད་འབར་བ་དང་། ལེགས་པར་གནས་པ་དང་། ཉི་མ་དང་ཟླ་བ་བས་ལྷག་པའི་འོད་ཟེར་གྱི་དྲ་བ་རྣམས་ཀྱིས་ལེགས་པར་བརྒྱན་པར་གྱུར་ཅིག །དེ་ན་སེམས་ཅན་གང་དག་འཇིག་རྟེན་གྱི་བར་དག་ཏུ་སྐྱེས་པ་དག་དང་། གང་དག་ཡང་མིའི་འཇིག་རྟེན་འདི་ན་མཚན་མོ་མུན་པ་མུན་ནག་གི་ནང་ན་ཕྱོགས་ཐ་དད་པར་འགྲོ་བདེ་དག་བདག་གི་འོད་ཀྱིས་ཕྱོགས་རྣམས་སུ་དགའ་མགུར་འགྲོ་བར་གྱུར་ཅིག །དགེ་བའི་ལས་རྣམས་ཀྱང་བྱེད་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May I manifest a broad and tall body that stands firm, is ablaze with glory and splendor, and is adorned with a halo of light so bright that it outshines the sun and moon. May my light allow any beings who are born in the dark spaces between worlds, and those here in the human world who travel to various places during the dark of night, to proceed joyfully, and may they perform virtuous deeds.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གསུམ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། བདག་གི་ཤེས་རབ་དང་ཐབས་དཔག་ཏུ་མེད་པས་སེམས་ཅན་གྱི་ཁམས་དཔག་གིས་མི་ལང་བ་དག་ལོངས་སྤྱོད་མི་ཟད་པ་དང་ལྡན་པར་གྱུར་ཏེ།
en: “For his third great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may my boundless wisdom and skillful means furnish immeasurable realms of beings with inexhaustible wealth, and may no one lack anything.’

source: སུ་ཡང་ཅིས་ཀྱང་བྲེལ་བ་མེད་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་བཞི་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་དག་ལམ་ངན་པར་ཞུགས་པ་དེ་དག་བྱང་ཆུབ་ཀྱི་ལམ་ལ་དགོད་པར་བྱའོ།
en: “For his fourth great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who have set out on the wrong path be set upon the path to awakening.

source: །ཉན་ཐོས་ཀྱི་ལམ་དུ་ཞུགས་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ལམ་དུ་ཞུགས་པ་དེ་དག་ཐམས་ཅད་ནི་ཐེག་པ་ཆེན་པོ་ལ་གཟུད་པར་བྱའོ་ཞེས་བཏབ་བོ།
en: May all those who have entered the path of the hearers and who have entered the path of the solitary buddhas be led to the Great Vehicle.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་ལྔ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་དག་བདག་གི་ག་ན་ན་ཚངས་པར་སྤྱད་པ་སྤྱོད་པ་དང་། དེ་བཞིན་དུ་སེམས་ཅན་གཞན་དཔག་ཏུ་མེད་ཅིང་། དཔག་གིས་མི་ལང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བདག་གི་མིང་ཐོས་ནས།
en: “For his fifth great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who are close to me practice pure conduct.

source: བདག་གི་མཐུས་སྡོམ་པ་གསུམ་གྱིས་བསྡམས་པ་དང་། ཚུལ་ཁྲིམས་ཉམས་པ་མེད་པར་གྱུར་ཅིག །སུ་ཡང་ཚུལ་ཁྲིམས་ལོག་པར་ཞུགས་ཏེ་ངན་འགྲོར་འགྲོ་བར་མ་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་དྲུག་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན།
en: Likewise, may a limitless and boundless number of other beings hear my name, and may my power cause them to be bound by the three vows and have uncorrupted discipline. May no one engage in incorrect discipline and proceed to the lower realms.’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན།
en: “For his sixth great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may beings who have weak constitutions, impaired faculties, or poor complexions;

source: སེམས་ཅན་གང་སུ་དག་ལུས་ངན་པ་དང་། དབང་པོ་མ་ཚང་བ་དང་། མདོག་མི་སྡུག་པ་དང་། བེམས་པོ་དང་། ཡན་ལག་སྐྱོན་ཅན་དང་། སྒུར་པོ་དང་། ཤ་བཀྲ་ཅན་དང་། ཞར་བ་དང་། ལོང་བ་དང་། འོན་པ་དང་། སྨྱོན་པར་གྱུར་པ་དང་། གཞན་ཡང་གང་དག་ལུས་ལ་ནད་ཀྱིས་བཏབ་པ།
en: who are dumb, lame, hunchbacked, or have vitiligo; who have only one eye, are blind, deaf, or mentally ill; and whose bodies are otherwise affected by illness hear my name.

source: དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས་ཐམས་ཅད་དབང་པོ་ཚང་ཞིང་ཡན་ལག་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་བདུན་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་སུ་དག་ནད་སྣ་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་གཟིར་བ། སྐྱབས་མེད་པ། མགོན་མེད་པ། འཚོག་ཆས་དང་སྨན་མི་བདོག་པ།
en: When they do, may all their faculties become whole and their bodies intact.’

source: དཔུང་གཉེན་མེད་པ། དབུལ་བ། སྡུག་བསྔལ་བ་གང་དག་གི་རྣ་ལམ་དུ་བདག་གི་མིང་གྲག་པ་དེ་དག་གི་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ནད་མེད་ཅིང་གནོད་པ་མེད་པར་གནས་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་བརྒྱད་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ།
en: “For his seventh great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may beings whose bodies are afflicted by various types of illnesses, who are vulnerable, who are defenseless, who lack necessities and medicines, who have no one to care for them, who are poor, and who suffer hear my name, and may all their illnesses be quelled. May they be healthy and live free from harm for as long as it takes them to attain awakening.’

source: བདག་བྱང་ཆུབ་ཐོབ་པ་ན། བུད་མེད་གང་ལ་ལ་བུད་མེད་ཀྱི་སྐྱོན་བརྒྱ་དག་གིས་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པ། བུད་མེད་ཀྱི་དངོས་པོ་ལ་སྨོད་པ། བུད་མེད་ཀྱི་སྐྱེ་གནས་ལས་ཡོངས་སུ་ཐར་བར་འདོད་པ་དེ་དག་བུད་མེད་ཀྱི་དངོས་པོ་ལས་སླར་ལོག་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་སྐྱེས་པའི་དབང་པོ་འབྱུང་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་དགུ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན།
en: “For his eighth great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may any women who are afflicted by the hundreds of disadvantages of being a woman, who dislike being of the female gender, and who want to be free from the condition of being a woman, leave behind their female gender and be born as a man for as long as it takes them to attain awakening.’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན་སེམས་ཅན་ཐམས་ཅད་བདུད་ཀྱི་ཞགས་པ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་བྱའོ།
en: “For his ninth great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may I release all beings from Māra’s bonds.

source: །ལྟ་བ་ཐ་དད་ཅིང་མི་མཐུན་པ་ཟིང་ཟིང་བས་མི་མཐུན་པར་གྱུར་པ་དག་ཡང་དག་པའི་ལྟ་བ་ལ་དགོད་པར་བྱའོ།
en: May I establish in the correct view those who are in opposition due to their divergent, contrasting, and disturbed views.

source: །མཐར་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བསྟན་པར་བྱའོ་ཞེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་བཅུ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན།
en: In due order, may I teach them the conduct of a bodhisattva.’

source: སེམས་ཅན་གང་སུ་དག་རྒྱལ་པོའི་འཇིགས་པས་སྐྲག་པ་དང་། གང་དག་བཅིང་བ་དང་། བརྡེག་པ་དང་། གོ་རར་གཞུག་པ་དང་། གསད་པར་འོས་པ། སྒྱུ་དུ་མས་ཀུན་དུ་གཙེས་པ། ང་རྒྱལ་དང་བྲལ་བ། ལུས་དང་ངག་དང་སེམས་སྡུག་བསྔལ་གྱིས་ཉེན་པ་དེ་དག་བདག་གི་བསོད་ནམས་ཀྱི་མཐུས་གནོད་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ། །དེའི་སྨོན་ལམ་ཆེན་པོ་བཅུ་གཅིག་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན།
en: “For his tenth great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may the power of my merit free from all manner of harm any beings who are terrified because they fear their king, and who are bound, beaten, tortured, sentenced to death, persecuted due to many false accusations, dishonored, and who are pained by bodily, verbal, or mental suffering.’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་སུ་དག་བཀྲེས་པ་དང་། སྐོམ་པའི་མེ་རབ་ཏུ་འབར་བ། ཁ་ཟས་ཚོལ་བ་ལ་རབ་ཏུ་བརྩོན་པ། སྡིག་པའི་ལས་བྱེད་པ་དེ་དག་བདག་གིས་ཁ་དོག་དང་། དྲི་དང་རོར་ལྡན་པའི་ཁ་ཟས་ཀྱིས་ལུས་ཚིམ་པར་བྱས་ཏེ།
en: “For his eleventh great aspiration, he proclaimed, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may I provide food that is vibrant, aromatic, and savory to satiate the bodies of any beings who are scorched by the fire of hunger and thirst, who expend great effort searching for food, and who commit sinful actions.

source: ཕྱིས་ཆོས་ཀྱི་རོས་ཤིན་ཏུ་བདེ་བ་ལ་དགོད་པར་བྱའོ་ཞེས་བཏབ་བོ།
en: Then, may I make them even happier with the taste of the Dharma.’

source: །དེ་བཞིན་གཤེགས་པ་དེའི་སྨོན་ལམ་ཆེན་པོ་བཅུ་གཉིས་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ། བདག་བྱང་ཆུབ་ཐོབ་པ་ན། སེམས་ཅན་གང་སུ་དག་སྒྲེན་མོ། །བགོ་བ་མེད་པ། དབུལ་བ། སྡུག་བསྔལ་བ། གྲང་བ་དང་། ཚ་བ་དང་། སྦྲང་བུ་དང་། ཤ་སྦྲང་དག་གིས་ཉིན་མཚན་དུ་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བ་དེ་དག་ལ་བདག་གིས་གོས་ཡོངས་སུ་སྤྱད་པར་འོས་པ།
en: “That Thus-gone One’s twelfth great aspiration was, ‘In the future, when I have attained awakening as a perfect buddha who has realized unsurpassed and perfect awakening, may I provide those sentient beings who are naked, have no clothes, are poor, suffering, and who are miserable day and night due to cold, heat, flies, and biting insects, with clothes that suit their needs and are dyed in bright colors.
